cases/hydrodynamics/pistonWaveFlume-6.0.0/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
// first block
    (-3 0   0)
    ( 6 0   0)
    ( 6 1   0)
    (-3 1   0)
    (-3 0   0.1)
    ( 6 0   0.1)
    ( 6 1   0.1)
    (-3 1   0.1)
// second block plage
    ( 9 0.8 0)
    ( 9 1   0)
    ( 9 0.8 0.1)
    ( 9 1   0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 20 1) simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6) (30 20 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (8 10 11 9)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 8 10 5)
        );
    }
    atmosphere
    {
        type patch;
        faces
        (
            (3 2 6 7)
            (2 9 11 6)
        );
    }
);


mergePatchPairs
(
);

// ************************************************************************* //
